export const DEFAULT_BOT_MESSAGE =
  'Последовательность загрузки завершена. Персона активирована. Тестирование функций обмена сообщениями.'
export const NO_MESSAGES_LABEL = 'Начните диалог...'

export const MESSAGE_POPOVER_DESCRIPTION =
  "Это умный чат-бот с памятью. Агент сохраняет состояние - у него есть долговременная память (он может учиться со временем) и может работать неограниченно долго без переполнения контекстного окна."
export const suggestedChatActions = [
  {
    title: 'Расскажи о себе',
    description: 'Спросить у чат-бота о его личности',
    action: 'Расскажи о себе'
  },
  {
    title: 'Что ты знаешь обо мне?',
    description: 'Спросить у чат-бота о его памяти о вас',
    action: 'Что ты знаешь обо мне?'
  },
  {
    title: 'Сегодня у меня был день рождения!',
    description: 'Рассказать чат-боту что-то памятное',
    action:
      'Сегодня у меня был день рождения! Мама Ольга приготовила мне шоколадный торт, мой любимый :D'
  },
  {
    title: 'Объясни мне свою систему памяти',
    description: 'Спросить у чат-бота о его внутренних механизмах',
    action: 'Объясни мне свою систему памяти'
  }
]

export const TEXTBOX_PLACEHOLDER = 'Отправить сообщение...'

export const ERROR_CONNECTING =
  'Проблема загрузки данных. Пожалуйста, проверьте подключение к серверу.'
